# Pandas - 데이터 조작

In [ ]:
import numpy as np
import pandas as pd

### 탐색을 위한 메소드

In [ ]:
filename = '서울시CCTV설치운영현황(자치구)_년도별_211231기준'
cctv = pd.read_csv(filename, skiprows=1, ending='EUC-KR')

TypeError: ignored

In [ ]:
cctv.info()

In [ ]:
cctv.describe()

In [ ]:
df = pd.DataFrame(np.random.randint(40,101,2).reshape(4,5)
                    columns=list('ABCDE'), index=list('wxyz'))
df

In [ ]:
df.info()

In [ ]:
df.describe()

- 통계: sum, mean, min, max, std, quantile

In [ ]:
df.sum()        # axis=0 가 default

In [ ]:
df.sta()

In [ ]:
df.quantile(0.25, axis=1)

- 결측치 처리

In [ ]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [ ]:
titanic.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
titanic.isna().sum().sum()

869

In [ ]:
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# age 결측치는 평균으로 대체
titanic.age.fillna(titanic.age.mean(), inplace=True)
titanic.tail(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# embarked 는 최빈값으로 대체
titanic.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [ ]:
titanic.embarked.fillna('S', inplace=True)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# embark_town 결측치는 행 삭제
titanic.dropna(subset=['embark_town'], inplace=True)
titanic.shape

(889, 15)

In [ ]:
# deck 결측치는 너무 많아서 컬럼 삭제
titanic.drop(columns=['deck'], inplace=True)
titanic.shape

(889, 14)

- apply

In [ ]:
df

NameError: ignored

In [ ]:
# 각 열의 최대값과 최소값의 차이
df.apply(lambda x: x.max() - x.min())

In [ ]:
# 각 행의 최대값과 최소값의 차이
df.apply(lambda x: x.max() - x.min(), axis=1)

In [ ]:
titanic['adult/child'] = titanic.age.apply(lambda x: 'adult' if x > 20 else 'child')
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone,adult/child
886,0,2,male,27.000000,0,0,13.00,S,Second,man,True,Southampton,no,True,adult
887,1,1,female,19.000000,0,0,30.00,S,First,woman,False,Southampton,yes,True,child
888,0,3,female,29.699118,1,2,23.45,S,Third,woman,False,Southampton,no,False,adult
889,1,1,male,26.000000,0,0,30.00,C,First,man,True,Cherbourg,yes,True,adult
890,0,3,male,32.000000,0,0,7.75,Q,Third,man,True,Queenstown,no,True,adult

In [ ]:
cctv.head(3)

In [ ]:
# 총계 컬럼 에서 천단위 구분기호를 없애고 정수로 변경
cctv['총계'] = cctv['총계'].apply(lambda x: int(x.replace(',','')))
cctv.head(3)

In [ ]:
# 결측치를 0으로 대체, 정수로 변환
cctv.isna().sum()

In [ ]:
cctv['2012년'].fillna(0, inplace=True)
cctv['2013년'].fillna(0, inplace=True)

In [ ]:
cctv.head()

In [ ]:
cctv.columns

In [ ]:
cctv.info()

In [ ]:
for columns in cctv.columns[2:]:
    cctv[column] = cctv[columns].apply(lambda x: int(x.replace(',','')))
cctv.head()